app/Http/Controllers/admin.php

update `utilisateurs` set `motDePasseUtilisateur` = 'yvGsYV9g6u0aQkDuQjNcvOaE0WIsaFS8TqO9JvCU4TcUUfbfolLvW', `utilisateurs`.`updated_at` = '2021-03-07 13:19:39' where `idUtilisateur` = '2'
select `mail` from `utilisateurs` where `idUtilisateur` = '2'
---
    public function updateMotDePasse()
    {
        $action = 2;
        $idUtilisateur = $_POST['idUtilisateur'];
        $id = $_POST['id'];
        $mdp = $_POST['motDePasse'];
        utilisateur::where("idUtilisateur", "=", $idUtilisateur)->update(array('motDePasseUtilisateur' => Hash::make($mdp)));

        // envoi du mail
        $req = utilisateur::select('mail')->where('idUtilisateur', '=', $idUtilisateur)->get();

select `idReservation`, `nomUtilisateur`, `positionFileAttente` from `reservations` inner join `utilisateurs` on `idUtilisateur` = `utilisateur` where `positionFileAttente` > 0
---
    public function listeattente()
    {
        $utilisateursFileAttente = reservation::join('utilisateurs', 'idUtilisateur', '=', 'utilisateur')->select('idReservation', 'nomUtilisateur', 'positionFileAttente')->where('positionFileAttente', '>', 0)->get();

select `idUtilisateur`, `nomUtilisateur`, `nom`, `prenom`, `mail`, `motDePasseUtilisateur`, `motDePasseOublie` from `utilisateurs` where `isAdministrateur` = 0
---
    public function listeUtilisateur()
    {
        $listeUtilisateur = utilisateur::select('idUtilisateur', 'nomUtilisateur', 'nom', 'prenom', 'mail', 'motDePasseUtilisateur', 'motDePasseOublie')->where('isAdministrateur', '=', false)->get();