app/Http/Controllers/user.php

    public function reservation()
    {
        $requete = utilisateur::select('*')->where('idUtilisateur', '=', $_POST['id'])->get();
        foreach ($requete as $requetedata) {
            $id = $requetedata->idUtilisateur;
            $nom = $requetedata->nom;
            $prenom = $requetedata->prenom;
        }
        $info = array(
            0 => $id,
            1 => $nom,
            2 => $prenom,
        );

        $reservation = reservation::select('idReservation')->where('utilisateur', '=', $info[0])->count();

        $dbreserv = array(
            0 => 0,
            1 => null,
        );

        if ($reservation == 0) {
            $dbreserv[0] = 1;
        }

        $dbreserv[1] = reservation::leftJoin('parkings', 'idParking', '=', 'reservations.numeroPlace')->select('*')->where('utilisateur', '=', $info)->get();
---
select * from `utilisateurs` where `idUtilisateur` = '14'
select count(*) as aggregate from `reservations` where `utilisateur` = 14
select * from `reservations` inner join `parkings` on `idParking` = `reservations`.`numeroPlace` where `utilisateur` = 14

    public function annule()
    {
        $annule = reservation::where('idReservation', '=', $_POST['id'])
            ->update(['etatReservation' => 1]);
---
update `reservations` set `etatReservation` = 1, `reservations`.`updated_at` = '2021-03-07 18:31:16' where `idReservation` = '20'

    public function formMDP()
    {
        $requete = utilisateur::select('*')->where('idUtilisateur', '=', $_POST['id'])->get();
---
select * from `utilisateurs` where `idUtilisateur` = '14'

    public function confirmMDP()
    {

        $action = 2;
        $user = array(
            0 => $_POST['iduser'],
            1 => 0,
        );
        $connect = utilisateur::select('motDePasseUtilisateur')->where('idUtilisateur', '=', $user[0])->get();
        foreach ($connect as $connectdata) {
            $old = $connectdata->motDePasseUtilisateur;
        }
        if (Hash::check($_POST['old'], $old)) {
            $update = utilisateur::where('idUtilisateur', '=', $user[0])
                ->update(['motDePasseUtilisateur' => Hash::make($_POST['new'])]);
---
select `motDePasseUtilisateur` from `utilisateurs` where `idUtilisateur` = '14'
update `utilisateurs` set `motDePasseUtilisateur` = 'y$ly5byGowPyATKWD4jte2VuiCnzkP0FVZbuepmbMo0yd79BvkYgHLi', `utilisateurs`.`updated_at` = '2021-03-07 18:47:31' where `idUtilisateur` = '14'